---
kind: property
id: P:Autodesk.Revit.DB.ExportFontInfo.DestinationFontName
source: html/04cefc1c-fe97-52e6-a840-9af9ee89a600.htm
---
# Autodesk.Revit.DB.ExportFontInfo.DestinationFontName Property

The destination font name (the name of the font in the exported format).

## Syntax (C#)
```csharp
public string DestinationFontName { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null